# Copyright (c) 2023, NVIDIA CORPORATION & AFFILIATES. All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions
# are met:
#  * Redistributions of source code must retain the above copyright
#    notice, this list of conditions and the following disclaimer.
#  * Redistributions in binary form must reproduce the above copyright
#    notice, this list of conditions and the following disclaimer in the
#    documentation and/or other materials provided with the distribution.
#  * Neither the name of NVIDIA CORPORATION nor the names of its
#    contributors may be used to endorse or promote products derived
#    from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY
# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR
# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

name: "yolov8Pose_licencePlate_ensemble"
platform: "ensemble"
max_batch_size: 64
input [
  {
    name: "input_image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  },
  {
    name: "input_orisize"
    data_type: TYPE_INT32
    dims: [ 2 ]
  },
  {
    name: "input_resize"
    data_type: TYPE_INT32
    dims: [ 2 ]
  }
]
output [
  {
    name: "output_bbox"
    data_type: TYPE_FP32
    dims: [ 6 ]
  },
  {
    name: "output_kpt"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  },
  {
    name: "output_num_crop"
    data_type: TYPE_INT32
    dims: [ 1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "yolov8_preprocessing"
      model_version: -1
      input_map {
        key: "yolov8_preprocessing_input"
        value: "input_image"
      }
      input_map {
        key: "yolov8_preprocessing_resize"
        value: "input_resize"
      }
      input_map {
        key: "yolov8_preprocessing_orisize"
        value: "input_orisize"
      }
      output_map {
        key: "yolov8_preprocessing_output"
        value: "preprocessed_image"
      }
    },
    {
      model_name: "yolov8Pose_licencePlate"
      model_version: -1
      input_map {
        key: "images"
        value: "preprocessed_image"
      }
      output_map {
        key: "output0"
        value: "output"
      }
    },
    {
      model_name: "yolov8_postprocessing"
      model_version: -1
      input_map {
        key: "yolov8_postprocessing_input"
        value: "output"
      }
      input_map {
        key: "yolov8_postprocessing_input_orisize"
        value: "input_orisize"
      }
      input_map {
        key: "yolov8_postprocessing_input_resize"
        value: "input_resize"
      }
      output_map {
        key: "yolov8_postprocessing_output_bbox"
        value: "output_bbox"
      }
      output_map {
        key: "yolov8_postprocessing_output_kpt"
        value: "output_kpt"
      }
      output_map {
        key: "yolov8_postprocessing_output_num_crop"
        value: "output_num_crop"
      }
    }
  ]
}

